results/1client_tmpfs/cockroachdb/cockroachdb_maxthroughput_memory_swapon_results/exp6_trial_6.txt
Adding shard node URL: jdbc:postgresql://10.0.0.35:26257/ycsb?sslmode=disable
Using shards: 1, batchSize:-1, fetchSize: -1
Still waiting for thread Thread-2 to complete. Workload status: true
Still waiting for thread Thread-2 to complete. Workload status: true
Still waiting for thread Thread-2 to complete. Workload status: true
[...]
[OVERALL], RunTime(ms), 1429210
[OVERALL], Throughput(ops/sec), 53.031394966449994
[TOTAL_GCS_Copy], Count, 2
[TOTAL_GC_TIME_Copy], Time(ms), 14
[TOTAL_GC_TIME_%_Copy], Time(%), 9.795621357253307E-4
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 2
[TOTAL_GC_TIME], Time(ms), 14
[TOTAL_GC_TIME_%], Time(%), 9.795621357253307E-4
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 500.0
[CLEANUP], MinLatency(us), 500
[CLEANUP], MaxLatency(us), 500
[CLEANUP], 99thPercentileLatency(us), 500
[CLEANUP], 99.9PercentileLatency(us), 500
[UPDATE], Operations, 75793
[UPDATE], AverageLatency(us), 18843.96572242819
[UPDATE], MinLatency(us), 863
[UPDATE], MaxLatency(us), 956825599
[UPDATE], 99thPercentileLatency(us), 54623
[UPDATE], 99.9PercentileLatency(us), 269567
[UPDATE], Return=OK, 75793